<template>
  <div class="page">
    <TopBanner
      v-if="!isPc"
      label="用户服务协议"
    ></TopBanner>
    <div v-if="isPc" class="pc-header leftCenter">
      <img :src="pcLogo" alt="">
      <span class="pc-logo-info">友信金服旗下品牌</span>
    </div>
    <div :class="{'pc-content': isPc}" :style="{backgroundColor: '#fff'}">
      <h2 class="center title">用户服务协议</h2>
      <p class="center">最后更新时间：{{time}}</p>
      <p class="indentItem">
        友众信业金融信息服务（上海）有限公司（以下简称“友信”或“友信平台”），是一家依法成立的从事专业的小额普惠信贷金融信息服务的公司，为有小额经营性借款需求为主的用户（以下简称“用户”或“您”）提供包括但不限于借款信息咨询、借款申请指导、借款渠道推荐等在内的金融信息服务。</p>
      <p class="indentItem">
        【请注意】您在友信运营的借款申请页面点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。在阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止借款申请程序，一经勾选本协议并点击“立即申请”按钮提交借款申请即视为您已阅读本协议所有条款，并对本协议条款的含义及相应的法律后果已全部通晓并充分理解，同意受本协议约束。</p>
      <p class="indentItem">
        本协议已对与您的权益具有或可能具有重大关系的条款，及对公司具有或可能具有免责或限制责任的条款（包括但不限于第七条“适用法律和管辖”项下有关本协议争议应由北京市朝阳区有管辖权的人民法院管辖的约定）用粗体字予以标注，请您注意。</p>
      <p class="indentItem">
        如果您同意本协议，或者您事实上存在使用友信产品或服务的行为，将被视为您本人完全接受本协议的全部内容及条款，包括接受友信对本协议随时所做的任何修改及更新，同时也表示您同意友信所发布或随时更新的其他相关声明，本协议和相关声明即构成对双方均具有约束力的法律文件。如您不同意本协议，您应立即停止申请借款或主动停止使用友信产品或服务。</p>
      <p>第一条 协议签署及修订</p>
      <p >1.1 您在开始借款申请程序并签署本协议前，应当具有中华人民共和国法律规定的与您行为相适应的民事行为能力，明确自己所享有的相应权利，且能够独立承担法律责任。<span
       >如您违反前述限制申请借款或使用友信平台服务，友信有权随时中止或终止您的用户资格。</span></p>
      <p>
        1.2 您在勾选本协议并点击“立即申请”按钮后，即视为您已确认并同意本协议的内容，您应妥善保管在您借款申请过程中友信向您发送的短信验证码（如有），并不得向任意第三方泄露此验证码，否则应承担该验证码泄露而造成的一切损失。</p>
      <p>
        1.3 本协议内容包括本协议正文所载之各条款及友信平台已经发布或将来可能发布的各类规则、解释、声明、通告等。所有上述规则、解释、声明及通告等均为本协议不可分割的组成部分，与本协议正文具有同等的法律效力。在您进行借款申请成为用户时，您已经阅读、理解并接受本协议正文的全部条款及友信平台的各类规则、解释、声明、通告等，并承诺、理解并接受在您成为友信平台用户后，友信平台不时发布的各类规则、解释、声明、通告等；您同意遵守中国及相关国家的各类法律、法规及规范性文件的规定，如有违反而导致任何法律后果的发生，您应以自己的名义独立承担所有相应的法律责任。</p>
      <p>1.4 <span>友信平台有权根据需要不时地修改本协议正文各条款或制定、修改各类规则、解释、声明、通告等并通过友信平台发布，不再另行单独通知。</span>您应不时地注意本协议正文各条款及各类规则、解释、声明、通告等的变更，若您在本协议正文相关条款和各类规则、解释、声明、通告变更后继续使用友信平台服务的，则视为您已充分阅读、理解并接受修改后的内容，也将遵循修改后的本协议正文条款及各类规则、解释、声明、通告等。若您不接受修改后的内容，请您立即停止使用友信平台的服务。
      </p>
      <p >1.5 您通过自行或授权相关主体确认本协议后，本协议即在您和友众信业金融信息服务（上海）有限公司之间产生法律效力。<span>您与其他友信平台用户或其他友信合作第三方之间因接受友信平台服务而产生的法律关系或法律纠纷均由您自行承担及解决，友众信业金融信息服务（上海）有限公司不承担任何责任。</span>
      </p>

      <p>第二条 服务内容</p>
      <p >2.1
        友信平台的具体服务以其友信实际提供的服务内容为准，并由友信根据实际情况不时更新。友信将定期或不定期根据您在本协议中的授权以电子邮件、短信、电话等方式为您提供服务信息，并向您提供相应服务。</p>
      <p >2.2 友信平台的服务仅供个人用户为申请借款之目的使用。除经友信书面同意，您不得将友信平台上的任何信息用于商业目的。</p>
      <p >2.3 您必须自行准备如下设备和承担如下开支：</p>
      <p >2.3.1 上网设备，包括但不限于电脑或者其他上网终端、调制解调器及其他上网装置；</p>
      <p >2.3.2 上网开支，包括但不限于网络接入费、上网设备租用费、收集流量费等。</p>

      <p>第三条 用户信息使用及保护</p>
      <p >3.1 <span>定义</span></p>
      <p >3.1.1 用户个人信息。指您为进行借款申请、使用友信提供的借款信息咨询、借款渠道推荐等服务，通过网络、电话或其他友信认可的途径一次或多次向友信提供的相关个人信息和资料，包括但不限于您的真实姓名、证件号码、手机号码、所在城市、个人资信情况（包括但不限于：月收入、车产、房产、商业保险、社会保险、公积金等信息及其它借贷或个人信用信息等）等；</p>
      <p>3.1.2 其他用户个人信息。指您在友信平台上留存的操作状态、使用记录、使用习惯等在内的全部记录信息；</p>
      <p>3.1.3 用户个人信息和其他用户个人信息以下合称“用户信息”；</p>
      <p>3.1.4 第三方合作平台（以下简称“第三方”）。指友信为向您提供借款信息咨询、借款渠道推荐服务而合作的金融信息服务机构或其他机构，包括但不限于：</p>

      <table class="table" border="1" cellpadding="0" cellspacing="0">
        <tr>
          <th>序号</th>
          <th>机构名称</th>
        </tr>
        <tr :key="$index" v-for="(platform, $index) in platformList">
          <td align="center">{{$index + 1}}</td>
          <td align="center">{{platform}}</td>
        </tr>
      </table>
      <p>3.2 您应本着诚实守信的原则，自行向友信提供个人信息以及借款申请相关的其他必要信息，您所提供的信息必须在合法基础上保证真实、准确、完整，并保证及时更新以上信息。<span
       >如因您的用户信息提供不真实、准确、完整或不及时更新，由此导致您在使用友信服务过程中遭受任何损失或增加任何费用或产生其他不利后果的，均应由您自行承担，友信保留中止或终止您使用友信平台各项服务的权利。</span>
      </p>
      <p>3.3
        友众信业金融信息服务（上海）有限公司在此承诺对用户信息予以严格保护与保密，您在此同意并授权友众信业金融信息服务（上海）有限公司可以直接使用您的用户信息用于如下用途而无需额外取得您的同意和/或授权：</p>
      <p>3.3.1
        您同意并授权友众信业金融信息服务（上海）有限公司在为您提供服务的过程中收集、储存、整合、使用并和第三方共享您的用户信息，对您提供的所有用户信息进行调查、核实，验证您提供的用户信息的真实性、准确性、完整性，并将您的信息用于与您借款申请及与友众信业金融信息服务（上海）有限公司所有业务及因业务而发生的相关活动中；</p>
      <p>3.3.2
        您同意并授权友众信业金融信息服务（上海）有限公司有针对性地向您推荐友信或第三方提供的产品、服务或推广活动。您同意友信及第三方通过电子邮件、电话、短信、微信等方式向您进行上述推荐，并提供、发送相关的通知和其他商业性信息；</p>
      <p>3.3.3 您同意并授权友众信业金融信息服务（上海）有限公司及其关联公司对您的用户信息进行内部归类、模型建设和分析等内部使用，以改进为您提供的服务；</p>
      <p>3.3.4 您同意并授权友众信业金融信息服务（上海）有限公司将来自某项服务的信息与来自其他服务的信息结合起来，以便为您提供更优质、个性化的服务、内容和建议；</p>
      <p>3.3.5 您同意并授权友众信业金融信息服务（上海）有限公司根据有关法律法规要求向有权的仲裁机构或司法、行政、立法等权力机关提供您的个人资料和信息；</p>
      <p >3.3.6 您授权的其他情形。</p>
      <p>3.4
        您清楚知晓、充分理解并接受上述信息被提供、采集和使用可能产生的不利后果，且理解友信虽然采取了严格的安全保护措施对所采集的上述信息实施了安全保护，但仍可能因不可抗力或科技本身所不可克服的漏洞或意外的恶意黑客攻击所导致的部分信息泄露的风险。</p>

      <p>第四条 权利与义务</p>
      <p >4.1
        用户同意在使用友信平台服务过程中，应遵守国家法律、法规，严格注意自身所发布的内容及提供的信息不违反国家相关法律法规的规定、不违背社会公德、不侵犯任何第三方的权利（包括但不限于隐私权、知识产权等）。<span
         >友信平台保有删除各类不符合法律政策或者不真实信息内容而无须通知用户的权利。</span>若用户未遵守以上约定，友信平台有权立即中止或终止对用户提供服务，并采取一切必要措施。</p>
      <p >4.2 用户不得利用友信平台提供的服务从事下述侵害他人合法权益之行为，否则友信平台有权立即中止或终止对用户提供服务，并采取一切必要措施：</p>
      <p >4.2.1 反对宪法所确定的基本原则，危害国家安全、泄漏国家秘密、颠覆国家政权、破坏国家统一的；</p>
      <p >4.2.2 侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益；</p>
      <p >4.2.4 冒用他人名义使用本服务;</p>
      <p >4.2.5 从事洗钱、窃取商业秘密、窃取其他用户个人信息等违法犯罪活动；</p>
      <p >4.2.6 从事非经友信平台同意的所有牟利性经营活动；</p>
      <p >4.2.7 侵入友信平台及其他计算机信息系统，传播病毒、特洛依木马等可能对友信平台和友信平台系统造成伤害或影响其正常运转的恶意病毒或程序；</p>
      <p >4.2.8 经友信有正当理由判定的其他不适当之行为。</p>

      <p>第五条 免责说明</p>
      <p>5.1 就下列相关事宜的发生，友信平台在此声明不承担任何法律责任：</p>
      <p>5.1.1
        用户应遵守国家的有关法律、法规和行政规章制度。如有用户违反国家法律法规或本协议，友信平台有权停止向用户提供服务而不需要承担任何责任；如用户的不法使用行为导致友信平台遭受任何损害或者遭受任何来自第三方的纠纷、诉讼、索赔要求等，用户须向友信平台赔偿相应的损失，用户需对其违反本协议所产生的一切后果承担全部法律责任；</p>
      <p>5.1.2 由于用户个人原因导致的任何个人信息的泄露，或其他非因友信平台方面原因导致的个人信息的泄露；</p>
      <p>5.1.3 任何通过黑客攻击、电脑病毒侵入等非法截取、访问等方式从友信平台上获取的信息；</p>
      <p>5.1.4 以及因台风、地震、海啸、洪水、停电、战争、恐怖袭击等国际通用不可抗力因素导致的任何后果。</p>
      <p>5.2
        本协议下的服务行为涉及到互联网及移动通讯等服务，可能受各个环节不稳定因素的影响，比如不可抗力、计算机病毒或者黑客攻击等造成的服务中断或不能满足用户要求的风险，用户须理解和认可，并承担以上风险。基于上述已经提及的可能发生的各环节不稳定因素影响，友信平台在此声明对服务的及时性、安全性、准确性不作担保，对因此导致用户不能接收信息，或者传递错误等问题不承担任何责任，用户须理解并认可。</p>
      <p>5.3
        如因友信平台的自有系统发生故障而影响到友信平台的正常运行，友信平台承诺第一时间内与相关单位配合，及时处理并进行修复。但用户因此而产生的经济损失，友信平台不承担责任。此外，友信平台保留不经事先通知为维修保养、升级或其他目的暂停友信平台全部或任何部分服务的权利。</p>
      <p>5.4 友信对于友信平台和第三方的服务不作任何明示或暗示的保证，包括但不限于以下事项：</p>
      <p>5.4.1 友信平台和第三方服务及上述服务涉及的技术或信息的适用性、持续性、准确性、可靠性或适用于某一特定用途；</p>
      <p>5.4.2 您经由友信平台获得的任何友信与第三方的产品、服务、资讯或其他资料将符合您的期望。</p>

      <p>第六条 知识产权</p>
      <p >6.1
        友众信业金融信息服务（上海）有限公司是友信平台和产品中所有信息内容的所有权及知识产权权利人。前述信息内容包括但不限于程序代码、界面设计、版面框架、数据资料、文字、图片、图形、图标、音频、视频等，按照法律法规规定应由相关权利人享有权利的内容除外。</p>
      <p >6.2
        未经友信及相关权利人授权，用户不得以任何方式和形式复制、模仿、传播、出版、公布、展示、使用本协议6.1条相关内容，包括但不限于电子的、机械的、复印的、录音录像的方式和形式等，用户亦不得将上述内容镜像到任何其他网站或者服务器。任何未经授权对上述内容的使用均属于违法行为，友众信业金融信息服务（上海）有限公司将依法追究法律责任。</p>

      <p>第七条 通知与送达</p>
      <p >7.1
        对于本协议项下的各项通知，友众信业金融信息服务（上海）有限公司有权以在友信平台公示的方式送达，也可以向您提供的电子邮箱和手机号码发送信息的方式送达，还可以拨打您的电话号码的方式送达，以及向您的住址以快递、挂号信的方式送达。上述各项通知如：</p>
      <p>7.1.1 以公示方式做出的，在公示当日即视为已经送达；</p>
      <p>7.1.2 以向您的友信平台账户、电子邮箱、手机号码以电子信息形式发送的，一经成功发送即视为已经送达；</p>
      <p>7.1.3 以电话形式发送的，通知作出之时即为送达；以快递、挂号信的方式发送的，投递之日起第三日视为送达。</p>
      <p >7.2 请您密切关注您的电子邮箱、邮件、信息及手机中的信息，并在您的联系方式发生变更时及时通知友信平台通过操作友信平台相关板块进行更新，<span
       >友众信业金融信息服务（上海）有限公司仅以您提供的联系方式为准向您发送各项通知，如您因未按上述约定及时进行联系方式更新而导致您发生任何损失的均由您自行承担。</span></p>
      <p>7.3
        您同时同意并确认，若您在终端设备或相关账户中设置了不接受友信平台的有关通知或提醒，则您有可能收不到该等通知信息，您不得以您未收到或未阅读该等通知信息主张相关通知未送达。</p>

      <p>第八条 适用法律和管辖</p>
      <p>
        因本协议的签署、履行产生的争议均适用中华人民共和国法律，并应向友众信业金融信息服务（上海）有限公司物理服务器所在地暨本协议签署地北京市朝阳区有管辖权的人民法院提起诉讼。</p>

      <p>第九条 其他</p>
      <p >友众信业金融信息服务（上海）有限公司对本协议拥有最终的解释权。若本协议的部分条款被认定为无效或者无法实施时，本协议中的其他条款仍然有效并应继续予以履行。</p>
      <p>如果您对本协议有任何疑问，请联系400-690-9666。</p>
    </div>
  </div>
</template>

<script>
  import TopBanner from '@/components/TopBanner.vue';
  import pcLogo from '@/assets/h5/pc_logo.png';
  import { companyGetAgreeTime, companyGetAgreeList } from '@/services/H5ServiceRequest';
  import Utils from '@/utils/utils.js';
  import moment from 'moment';
  export default {
    name: 'Agreement',
    data: function () {
      return {
        isPc: true,
        platformList: [],
        pcLogo,
        time: ''
      };
    },
    components: {
      TopBanner
    },
    created: function () {
      this.companyGetAgreeTime();
      this.companyGetAgreeList();
      this.isPc = Utils.isPc();
    },
    methods: {
      companyGetAgreeList () {
        companyGetAgreeList().then(res => {
          this.platformList = res.data;
        });
      },
      companyGetAgreeTime () {
        companyGetAgreeTime().then(res => {
          this.time = moment(res.data).format('YYYY年MM月DD日');
        });
      }
    }
  };
</script>

<style scoped>
  html {
    background: #ffffff;
  }

  .page {
    min-height: 100%;
  }
  .title {
    line-height: 50px;
    font-size: 16px;
  }

  p {
    line-height: 1.5;
    padding: 0 15px;
    padding-bottom: 10px;
    color: #888888;
    text-align: left;
  }

  .pc-header {
    background: #FFFFFF;
    height: 50px;
    padding-left: 200px;
  }

  .pc-logo-info {
    color: #465582;
    margin-left: 20px;
    margin-top: 5px;
  }
  .indentItem {
    text-indent: 2em;
  }

  .table {
    width: 90%;
    margin: 20px;
  }
  .center {
    text-align: center;
  }
  .pc-content {
    width: 1020px;
    padding: 30px;
    margin: 0 auto;
    margin-top: 20px;
    margin-bottom: 20px;
  }
</style>
